app/controllers/students_controller.rb

    def update
      @student = Student.find(params[:id])
      @student.first_name = params[:student][:first_name]
      @student.last_name = params[:student][:last_name]
      @student.save
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-08-16 14:11:10.053344"], ["id", 1]]